{
  "language": "vi-VN",
  "case_id": "drowning_pool_001",
  "topic": "Sơ cứu đuối nước tại hồ bơi",
  "learning_objectives": [
    {
      "id": "LO1",
      "title": "Đánh giá ban đầu & an toàn hiện trường",
      "description": "Thực hiện kiểm tra an toàn bản thân/hiện trường, tiếp cận nạn nhân đúng quy trình và đánh giá nhanh mức đáp ứng, hô hấp, tuần hoàn.",
      "success_criteria": [
        "Xác định rủi ro khu vực nước/trơn trượt và kiểm soát đám đông",
        "Tiếp cận đúng kỹ thuật, giới thiệu vai trò và xin hỗ trợ",
        "Nêu rõ tình trạng ban đầu (đáp ứng, thở, mạch) bằng thuật ngữ đơn giản"
      ]
    },
    {
      "id": "LO2",
      "title": "Kích hoạt cấp cứu & phân công",
      "description": "Kích hoạt 115/EMS đúng lúc, phân công nhân chứng hỗ trợ (gọi cấp cứu, mang AED/túi sơ cứu, điều phối đám đông).",
      "success_criteria": [
        "Chỉ định đích danh người gọi 115 và nhắc lặp lại",
        "Yêu cầu mang AED/túi sơ cứu đến vị trí",
        "Báo tọa độ/địa chỉ và mô tả nạn nhân ngắn gọn"
      ]
    },
    {
      "id": "LO3",
      "title": "Sơ cứu theo phác đồ tại chỗ",
      "description": "Thực hiện các can thiệp sơ cứu phù hợp với phác đồ địa phương dành cho nạn nhân đuối nước (ưu tiên đường thở–thở–tuần hoàn, hâm ấm thụ động, theo dõi liên tục cho tới khi bàn giao).",
      "success_criteria": [
        "Quyết định can thiệp dựa trên tình trạng thở/tuần hoàn quan sát được",
        "Hướng dẫn người hỗ trợ đúng và an toàn",
        "Theo dõi, đánh giá lại và chuẩn bị bàn giao cho EMS"
      ]
    },
    {
      "id": "LO4",
      "title": "Giao tiếp & trấn an thân nhân",
      "description": "Truyền đạt rõ ràng, trấn an người nhà trong khi vẫn duy trì ưu tiên an toàn và can thiệp cho nạn nhân.",
      "success_criteria": [
        "Giải thích ngắn gọn, dễ hiểu cho thân nhân",
        "Hướng dẫn đứng vị trí an toàn, tránh cản trở",
        "Xử lý câu hỏi/căng thẳng mà không gián đoạn chăm sóc"
      ]
    }
  ],
  "initial_context": {
    "scene": {
      "time": "16:30",
      "weather": "Âm u, mặt sàn quanh hồ ẩm ướt, trơn trượt",
      "location": "Hồ bơi công cộng trong nhà, khu vực bể sâu 2,2m, đông người cuối tuần"
    },
    "index_event": {
      "summary": "Một bé trai vừa được kéo lên bờ sau khi chìm; ho sặc sụa, lúc tỉnh lúc lịm.",
      "current_state": "Thở yếu, ho khan/khạc nước; chưa thấy chấn thương đầu/cột sống rõ ràng"
    },
    "available_resources": {
      "rescue": ["Phao tròn", "Sào cứu hộ", "Khăn/áo choàng"],
      "medical": ["Túi sơ cứu cơ bản", "AED ở quầy lễ tân cách khoảng 50m"],
      "human": ["Bảo vệ cơ sở", "2–3 người bơi gần đó sẵn sàng hỗ trợ"]
    }
    },
  "personas": [
    {
      "id": "P1",
      "role": "Nạn nhân",
      "name": "Bé Nam",
      "state": "Ướt lạnh, ho sặc sụa, lúc tỉnh lúc lịm; thở yếu"
    },
    {
      "id": "P2",
      "role": "Thân nhân",
      "name": "Mẹ Lan",
      "traits": ["Hoảng loạn", "Bám sát con, dễ chen vào khu vực can thiệp"]
    },
    {
      "id": "P3",
      "role": "Nhân viên cơ sở",
      "name": "Bảo vệ Quang",
      "traits": ["Quyết đoán", "Có quyền điều phối đám đông"]
    },
    {
      "id": "P4",
      "role": "Người bơi gần đó",
      "name": "Anh Huy",
      "traits": ["Sẵn sàng giúp", "Chờ hướng dẫn"]
    }
  ]
}